{"id": "sec437_chunk_1", "text": "Section 437 CrPC: Bail in Non-Bailable Offences\nSection 437 CrPC  When bail may be taken in case of nonbailable offence:\n1. A person accused of a non-bailable offence may be released on bail, unless:\n- There are reasonable grounds to believe they are guilty of an offence punishable with death or life\nimprisonment.\n- The accused has previous convictions for serious offences.\n- Exceptions apply for women, minors, infirm persons, or special reasons.\n2. Conditions of Bail:\n- The accused must not com", "metadata": {"source": "Section_437_CrPC_Case_Summaries.pdf", "section": "CrPC 437", "page_estimate": 1}}
{"id": "sec437_chunk_2", "text": "mit similar offences or tamper with evidence.\n- Must attend court proceedings regularly.\n3. Trial Delay Provision:\n- If the trial isn't concluded within 60 days from the first evidence date before a Magistrate, the accused may\nbe released on bail.\n4. Post-Trial Bail:\n- If the court believes there are grounds to presume innocence after trial but before judgment, the accused\nshall be released on bond.\n5. Bail Cancellation:\n- Court can cancel bail and remand the accused to custody if necessary.\n---", "metadata": {"source": "Section_437_CrPC_Case_Summaries.pdf", "section": "CrPC 437", "page_estimate": 1}}
{"id": "sec437_chunk_3", "text": "---------------------------\nKey Case Summaries:\n1. Subhelal Sushil Sahu v. State of Chhattisgarh:\n- Bail granted due to delay beyond 60 days in trial, upholding Article 21 (Right to Speedy Trial).\n2. Kalyan Chandra Sarkar v. Rajesh Ranjan (2005):\n- Bail decisions must consider liberty vs societal interestdiscretion applied cautiously.\n3. Siddharam Satlingappa Mhetre v. State of Maharashtra (2010):\n- Past convictions alone not sufficient ground to deny bail; personal circumstances matter.\n4. Gurc", "metadata": {"source": "Section_437_CrPC_Case_Summaries.pdf", "section": "CrPC 437", "page_estimate": 1}}
{"id": "sec437_chunk_4", "text": "haran Singh v. State (Delhi Administration) (1977):\n- Clarified that stricter bail conditions apply only to more serious offences.\n5. State of Kerala v. Raneef (2011):\n- Key factors: gravity of offence, evidence, risk of fleeing, tampering with witnesses, and trial delay.\nThis document provides a summary of Section 437 of CrPC and leading case interpretations to support legal\nunderstanding and vector-based legal search systems.", "metadata": {"source": "Section_437_CrPC_Case_Summaries.pdf", "section": "CrPC 437", "page_estimate": 1}}
